Учёт/МойУчёт/src/Documents/ВводДенег/ВводДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводДенег</name>
  <registerRecords>AccumulationRegister.Деньги</registerRecords>
  <attributes>
    <name>Кошелёк</name>
    <type>
      <types>CatalogRef.Кошельки</types>
    </type>
  </attributes>
  <attributes>
    <name>С</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>По_</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокНаНачало</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокНаКонец</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиДДС</types>
      </type>
    </attributes>
    <attributes>
      <name>КорКошелёк</name>
      <type>
        <types>CatalogRef.Кошельки</types>
      </type>
    </attributes>
    <attributes>
      <name>КорДокумент</name>
      <type>
        <types>DocumentRef.ВводДенег</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокПоВыписке</name>
      <comment>Для сортировки как в выписке банка</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокПоУведомлению</name>
      <comment>Для сортировки как в уведомлениях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учёт/МойУчёт/src/AccumulationRegisters/Деньги/Деньги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Деньги</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Поступление</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокПоВыписке</name>
    <comment>Для сортировки как в выписке банка</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокПоУведомлению</name>
    <comment>Для сортировки как в уведомлениях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Кошелёк</name>
    <type>
      <types>CatalogRef.Кошельки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приход</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учёт/МойУчёт/src/Documents/ВводДенег/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для каждого СтрокаТЧ Из Состав Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Время) И ЗначениеЗаполнено(СтрокаТЧ.Статья) Тогда
			НоваяЗапись = Движения.Деньги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЧ);
			НоваяЗапись.Кошелёк = Кошелёк;
			НоваяЗапись.Период = СтрокаТЧ.Время;
			НоваяЗапись.Поступление = СтрокаТЧ.Сумма;
			НоваяЗапись.Приход = СтрокаТЧ.Сумма >= 0;
			//НоваяЗапись.НомерСтроки = СтрокаТЧ.НомерСтроки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
